Reports/НалогНаИмуществоЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>НалогНаИмуществоЮридическихЛиц</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВОтдельномОкне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидированный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровыватьПриложение3и4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаДляНеУстановленных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.КоличественныйСЗ</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.КоличественныйСЗ</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизацийБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизацийБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛьготныеОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЛьготныеОсновныеСредства</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛизинговыеОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЛизинговыеОсновныеСредства</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лизинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретенныеОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретенныеНематериальныеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыНаПереработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроисхождениеНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПроисхождениеНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияОсновногоСредства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДавальческогоСырья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДавальческогоСырья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестонахождениеОСДляГНИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоНахождениеОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАктиваДляЗачетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктиваДляЗачетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/НалогНаИмуществоЮридическихЛиц/Ext/ObjectModule.bsl
Процедура ВывестиРасшифровкуДляПриложения3(Выборка, Период)

	//Состояние("Расшифровка - не введенные в срок основные средства...");
	
	РасшТаб = Новый ТабличныйДокумент;
	РасшМакет = ПолучитьМакет("РасшифровкаДляПриложения3");
	РасшОбластьШапка = РасшМакет.ПолучитьОбласть("Шапка");
	РасшОбластьСтрока = РасшМакет.ПолучитьОбласть("Строка");
	РасшОбластьПодвал = РасшМакет.ПолучитьОбласть("Подвал");
	
	РасшТаб.Вывести(РасшОбластьШапка);     	
	
	Стоимость = 0;
	
	нпп = 0;
	Пока Выборка.Следующий() Цикл
		нпп = нпп + 1;
		//Состояние("Расшифровка не введенные в срок основные средства "+Строка(нпп));
		РасшОбластьСтрока.Параметры.Заполнить(Выборка);
		РасшОбластьСтрока.Параметры.нпп = нпп;
		РасшТаб.Вывести(РасшОбластьСтрока);
        Стоимость = Стоимость + Выборка.СуммаОстаток;
	КонецЦикла; 
	
	РасшОбластьПодвал.Параметры.Стоимость = Стоимость;
	РасшТаб.Вывести(РасшОбластьПодвал);
	РасшТаб.Показать("Расшифровка - не введенные в срок основные средства ("+Формат(Период, "ДФ='MMMM yyyy'")+")");
	
КонецПроцедуры	
	
Функция Приложение3_Получить(НачалоПериода, КонецПериода, РасшифровкаРазрешена = Истина) Экспорт
	
	Перем Сумма;
	
	//Состояние("Не введенные в срок основные средства...");
	
	Сумма = 0;
	
	ТекПериод = КонецМесяца(НачалоПериода);
	
	Пока Не ТекПериод = КонецМесяца(КонецПериода) Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК ОС,
		               |	Номенклатура.Код КАК ИН,
		               |	Номенклатура.ДатаПоступленияОсновногоСредства,
		               |	Номенклатура.ДатаВводаВЭксплуатацию,
		               |	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		               |				&Период,
		               |				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0800)),
		               |				,
		               |				ВЫБОР
		               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ Организация = &Организация
		               |				КОНЕЦ) КАК ХозрасчетныйОстатки
		               |		ПО Номенклатура.Ссылка = ХозрасчетныйОстатки.Субконто1
		               |ГДЕ
		               |	Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ПриобретенныеОсновныеСредства)
		               |	И ХозрасчетныйОстатки.СуммаОстаток > 0
		               |	И Номенклатура.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
		               |	И Номенклатура.ДатаВводаВЭксплуатацию < КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Номенклатура.Ссылка,
		               |	Номенклатура.Код,
		               |	Номенклатура.ДатаПоступленияОсновногоСредства,
		               |	Номенклатура.ДатаВводаВЭксплуатацию
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ОБЩИЕ";
		
		Запрос.УстановитьПараметр("Период", ТекПериод);
		Запрос.УстановитьПараметр("Организация", Организация); 
		
		Результат = Запрос.Выполнить();
		ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтог.Следующий() Тогда
			Сумма = Сумма + ?(ВыборкаИтог.СуммаОстаток=Null,0,ВыборкаИтог.СуммаОстаток);
			Если РасшифровыватьПриложение3и4 И РасшифровкаРазрешена Тогда
				ВывестиРасшифровкуДляПриложения3(ВыборкаИтог.Выбрать(), ТекПериод);		
			КонецЕсли; 
		КонецЕсли;         		
		
		ТекПериод = ДобавитьМесяц(ТекПериод, 1);
		ТекПериод = КонецМесяца(ТекПериод);
		
	КонецЦикла; 
	
	Возврат Сумма/12;
	
КонецФункции

Процедура ВывестиРасшифровкуДляЛьготныхОСПриложения4(Выборка, Период)

	//Состояние("Расшифровка - льготные основные средства...");
	
	СуммаЛьготныхОС = 0;
	
	РасшТаб = Новый ТабличныйДокумент;
	РасшМакет = ПолучитьМакет("РасшифровкаДляПриложения4");
	РасшОбластьШапка = РасшМакет.ПолучитьОбласть("Шапка");
	РасшОбластьСтрока = РасшМакет.ПолучитьОбласть("Строка");
	РасшОбластьПодвал = РасшМакет.ПолучитьОбласть("Подвал");
	
	РасшТаб.Вывести(РасшОбластьШапка);     	
	
	нпп = 0;
	Пока Выборка.Следующий() Цикл
		нпп = нпп + 1;
		РасшОбластьСтрока.Параметры.Заполнить(Выборка);
		РасшОбластьСтрока.Параметры.Месяц = Формат(Период, "ДФ=MMMM.yyyy");
		РасшОбластьСтрока.Параметры.нпп = нпп;
		РасшТаб.Вывести(РасшОбластьСтрока);
		СуммаЛьготныхОС = СуммаЛьготныхОС + ?(Выборка.ОстаточнаяСтоимость=Null,0,Выборка.ОстаточнаяСтоимость);
	КонецЦикла;
	
	РасшОбластьПодвал.Параметры.ОстаточнаяСтоимость = СуммаЛьготныхОС;
	РасшТаб.Вывести(РасшОбластьПодвал);
	РасшТаб.Показать("Расшифровка - льготные основные средства ("+Формат(Период, "ДФ='MMMM yyyy'")+")");
	
КонецПроцедуры

Процедура ВывестиРасшифровкуДляЛизинговыхОСПриложения4(Выборка, Период)

	//Состояние("Расшифровка - лизинговые основные средства...");
	
	СуммаЛизинговыхОС = 0;
	
	РасшТаб = Новый ТабличныйДокумент;
	РасшМакет = ПолучитьМакет("РасшифровкаДляПриложения4");
	РасшОбластьШапка = РасшМакет.ПолучитьОбласть("Шапка");
	РасшОбластьСтрока = РасшМакет.ПолучитьОбласть("Строка");
	РасшОбластьПодвал = РасшМакет.ПолучитьОбласть("Подвал");
	
	РасшТаб.Вывести(РасшОбластьШапка);     	
	
	нпп = 0;
	Пока Выборка.Следующий() Цикл
		нпп = нпп + 1;
		РасшОбластьСтрока.Параметры.Заполнить(Выборка);
		РасшОбластьСтрока.Параметры.Месяц = Формат(Период, "ДФ=MMMM.yyyy");
		РасшОбластьСтрока.Параметры.нпп = нпп;
		РасшТаб.Вывести(РасшОбластьСтрока);
		СуммаЛизинговыхОС = СуммаЛизинговыхОС + ?(Выборка.ОстаточнаяСтоимость=Null,0,Выборка.ОстаточнаяСтоимость);
	КонецЦикла;
	
	РасшОбластьПодвал.Параметры.ОстаточнаяСтоимость = СуммаЛизинговыхОС;
	РасшТаб.Вывести(РасшОбластьПодвал);
	РасшТаб.Показать("Расшифровка - лизинговые основные средства ("+Формат(Период, "ДФ='MMMM yyyy'")+")");
	
КонецПроцедуры

Функция Приложение4_Получить(НачалоПериода, КонецПериода, ПолучитьСтроку = Ложь, Стр = "", РасшифровкаРазрешена = Истина) Экспорт
	
	Строки = Новый Структура;
	
	а010 = 0;
	а020 = 0;
	а0207 = 0;
	а02011 = 0;
	
	// СОЗДАНИЕ ВРЕМЕННЫХ ТАБЛИЦ
	
	//Состояние("Создание временных таблиц...");
	
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.ОсновноеСредство КАК ОсновноеСредство,
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.ДатаСостояния КАК ДатаСостояния
	               |ПОМЕСТИТЬ ДатыВводаВЭксплуатацию
	               |ИЗ
	               |	РегистрСведений.СостоянияОСОрганизацийБухгалтерскийУчет КАК СостоянияОСОрганизацийБухгалтерскийУчет
	               |ГДЕ
	               |	СостоянияОСОрганизацийБухгалтерскийУчет.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	               |	И ВЫБОР
	               |			КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ &Организация = СостоянияОСОрганизацийБухгалтерскийУчет.Организация
	               |		КОНЕЦ";
				   
	Запрос.УстановитьПараметр("Организация", Организация); 			   
				   
	Результат = Запрос.Выполнить();
	
	// ЛЬГОТНЫЕ ОС
	
	//Состояние("Льготные основные средства...");
	
	СуммаЛьготныхОС = 0;
	
	ТекПериод = КонецМесяца(НачалоПериода);
	
	Пока Не ТекПериод = КонецМесяца(КонецПериода) Цикл
		
		//Состояние("Льготные основные средства "+Строка(ТекПериод));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		
		Запрос.Текст = "ВЫБРАТЬ
					   |	СУММА(Стоимость.СуммаОстатокДт) КАК Стоимость,
					   |	СУММА(Износ.СуммаОстатокКт) КАК Износ,
					   |	СУММА(ЕстьNull(Стоимость.СуммаОстатокДт, 0) - ЕстьNull(Износ.СуммаОстатокКт, 0)) КАК ОстаточнаяСтоимость,
					   |	Стоимость.Субконто1 КАК ОС,
					   |	Стоимость.Субконто1.Код КАК ИН
					   |ИЗ
					   |	РегистрБухгалтерии.Хозрасчетный.Остатки(
					   |			&Период,
					   |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0100))
					   |				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0300)),
					   |			,
					   |			ВЫБОР
					   |				КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
					   |					ТОГДА ИСТИНА
					   |				ИНАЧЕ &Организация = Организация
					   |			КОНЕЦ) КАК Стоимость
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
					   |				&Период,
					   |				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0200)),
					   |				,
					   |				ВЫБОР
					   |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
					   |						ТОГДА ИСТИНА
					   |					ИНАЧЕ &Организация = Организация
					   |				КОНЕЦ) КАК Износ
					   |		ПО Стоимость.Субконто1 = Износ.Субконто1
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛьготныеОсновныеСредства.СрезПоследних(
					   |				,
					   |				ВЫБОР
					   |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
					   |						ТОГДА ИСТИНА
					   |					ИНАЧЕ &Организация = Организация
					   |				КОНЕЦ) КАК ЛьготныеОсновныеСредстваСрезПоследних
					   |		ПО Стоимость.Субконто1 = ЛьготныеОсновныеСредстваСрезПоследних.ОсновноеСредство
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВводаВЭксплуатацию КАК ДатыВводаВЭксплуатацию
					   |		ПО Стоимость.Субконто1 = ДатыВводаВЭксплуатацию.ОсновноеСредство
					   |ГДЕ
					   |	ЛьготныеОсновныеСредстваСрезПоследних.Льгота
					   |	И РАЗНОСТЬДАТ(ДатыВводаВЭксплуатацию.ДатаСостояния, &Период, МЕСЯЦ) / 12 < 5
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	Стоимость.Субконто1,
					   |	Стоимость.Субконто1.Код
					   |ИТОГИ
					   |	СУММА(ОстаточнаяСтоимость)
					   |ПО
					   |	ОБЩИЕ";
					   
		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекПериод)); 
		Запрос.УстановитьПараметр("Организация", Организация); 
					   
		Результат = Запрос.Выполнить();
		ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтог.Следующий() Тогда
			СуммаЛьготныхОС = СуммаЛьготныхОС + ?(ВыборкаИтог.ОстаточнаяСтоимость=Null,0,ВыборкаИтог.ОстаточнаяСтоимость);			
			Если РасшифровыватьПриложение3и4 И РасшифровкаРазрешена Тогда
				ВывестиРасшифровкуДляЛьготныхОСПриложения4(ВыборкаИтог.Выбрать(), ТекПериод);
			КонецЕсли;
		КонецЕсли;
		
		ТекПериод = ДобавитьМесяц(ТекПериод, 1);
		ТекПериод = КонецМесяца(ТекПериод);
		
	КонецЦикла; 
	
	а0207 = СуммаЛьготныхОС/12;
	
	// ЛИЗИНГОВЫЕ ОС
	
	//Состояние("Лизинговые основные средства...");
	
	СуммаЛизинговыхОС = 0;
	
	ТекПериод = КонецМесяца(НачалоПериода);
	
	Пока Не ТекПериод = КонецМесяца(КонецПериода) Цикл
		
		//Состояние("Лизинговые основные средства "+Строка(ТекПериод));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(Стоимость.СуммаОстатокДт) КАК Стоимость,
		               |	СУММА(Износ.СуммаОстатокКт) КАК Износ,
		               |	СУММА(ЕСТЬNULL(Стоимость.СуммаОстатокДт, 0) - ЕСТЬNULL(Износ.СуммаОстатокКт, 0)) КАК ОстаточнаяСтоимость,
		               |	Стоимость.Субконто1 КАК ОС,
		               |	Стоимость.Субконто1.Код КАК ИН
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
		               |			&Период,
		               |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0100))
		               |				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0300)),
		               |			,
		               |			ВЫБОР
		               |				КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ &Организация = Организация
		               |			КОНЕЦ) КАК Стоимость
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		               |				&Период,
		               |				Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А0200)),
		               |				,
		               |				ВЫБОР
		               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ &Организация = Организация
		               |				КОНЕЦ) КАК Износ
		               |		ПО Стоимость.Субконто1 = Износ.Субконто1
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ДатыВводаВЭксплуатацию КАК ДатыВводаВЭксплуатацию
		               |		ПО Стоимость.Субконто1 = ДатыВводаВЭксплуатацию.ОсновноеСредство
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛизинговыеОсновныеСредства.СрезПоследних(
		               |				,
		               |				ВЫБОР
		               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ &Организация = Организация
		               |				КОНЕЦ) КАК ЛизинговыеОсновныеСредстваСрезПоследних
		               |		ПО Стоимость.Субконто1 = ЛизинговыеОсновныеСредстваСрезПоследних.ОсновноеСредство
		               |ГДЕ
		               |	РАЗНОСТЬДАТ(ДатыВводаВЭксплуатацию.ДатаСостояния, &Период, МЕСЯЦ) < ЛизинговыеОсновныеСредстваСрезПоследних.СрокМесяцев
		               |	И ЛизинговыеОсновныеСредстваСрезПоследних.Лизинг
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Стоимость.Субконто1,
		               |	Стоимость.Субконто1.Код
		               |ИТОГИ
		               |	СУММА(ОстаточнаяСтоимость)
		               |ПО
		               |	ОБЩИЕ";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекПериод)); 
		Запрос.УстановитьПараметр("Организация", Организация); 
		
		Результат = Запрос.Выполнить();
		ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтог.Следующий() Тогда		
			СуммаЛизинговыхОС = СуммаЛизинговыхОС + ?(ВыборкаИтог.ОстаточнаяСтоимость=Null,0,ВыборкаИтог.ОстаточнаяСтоимость);
			Если РасшифровыватьПриложение3и4 И РасшифровкаРазрешена Тогда
				ВывестиРасшифровкуДляЛизинговыхОСПриложения4(ВыборкаИтог.Выбрать(), ТекПериод);
			КонецЕсли; 
		КонецЕсли;	
		
		ТекПериод = ДобавитьМесяц(ТекПериод, 1);
		ТекПериод = КонецМесяца(ТекПериод);
		
	КонецЦикла; 
	
	а02011 = СуммаЛизинговыхОС/12;
	
	
	а020 = а0207 + а02011;
	а010 = а020;
	
	Строки.Вставить("а010", а010);
	Строки.Вставить("а020", а020);
	Строки.Вставить("а0207", а0207);
	Строки.Вставить("а02011", а02011);

	//// ДЛЯ КОНСОЛИДАЦИИ {
	//
	//Если Консолидированный Тогда
	//	НалоговаяОтчетность.ДобавитьЗначенияПараметровОтчетностиДляКонсолидации(Справочники.ПараметрыОтчетностиДляКонсолидации.НалогНаДобавленнуюСтоимостьПриложение1,Строки,НачалоДня(НачалоПериода),КонецДня(НачалоПериода));
	//КонецЕсли;
	//
	//// } ДЛЯ КОНСОЛИДАЦИИ
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции
 
Функция Приложение6_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	Строки = Новый Структура;
	
	а010 = 0;
	а020 = 0;
	а030 = 0;
	а040 = 0;
	а050 = 0;
	а060 = 0;
	
	а010 = НалоговаяОтчетность.РассчитатьОбъемВыполненныхРаботЗаПериод(Организация,НачалоГода(НачалоПериода),КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	               |	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НП,
	               |			&КП,
	               |			,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А9020),
	               |			,
	               |			ВЫБОР
	               |				КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ Организация = &Организация
	               |			КОНЕЦ,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Субконто1,
	               |	ХозрасчетныйОбороты.Субконто2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Субконто1,
	               |	Субконто2";
	
	Запрос.УстановитьПараметр("НП", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("КП", КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация); 
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		а020 = Выборка.Сумма;
	КонецЕсли;	 
	
	а030 = а020;
	
	а040 = а020*100/а010;
	
	а050 = Ставка;
	
	Если (а040 >= 15)И(а040 < 30) Тогда
		а060 = а050 - а050*0.3;
	ИначеЕсли а040 >= 30 Тогда
		а060 = а050*0.5;
	КонецЕсли; 
	
	Строки.Вставить("а010", а010);
	Строки.Вставить("а020", а020);
	Строки.Вставить("а030", а030);
	Строки.Вставить("а040", а040);
	Строки.Вставить("а050", а050);
	Строки.Вставить("а060", а060);

	//// ДЛЯ КОНСОЛИДАЦИИ {
	//
	//Если Консолидированный Тогда
	//	НалоговаяОтчетность.ДобавитьЗначенияПараметровОтчетностиДляКонсолидации(Справочники.ПараметрыОтчетностиДляКонсолидации.НалогНаДобавленнуюСтоимостьПриложение1,Строки,НачалоДня(НачалоПериода),КонецДня(НачалоПериода));
	//КонецЕсли;
	//
	//// } ДЛЯ КОНСОЛИДАЦИИ
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции
